# -*- lexical-binding: t; org-insert-tilde-language: emacs-lisp; -*-
#+TITLE: Take on Rules
#+SUBTITLE: Or How I Want to Test This Thing Out
#+AUTHOR: Jeremy Friesen
#+EMAIL: jeremy@jeremyfriesen.com
#+FILETAGS: :takeonrules:
#+STARTUP: showall
#+PROPERTY: header-args:emacs-lisp :comments link
#+OPTIONS: toc:3

By now, with all that I’ve written, it should be evident that knowledge management is both a critical need and something that Emacs must certainly support.

Another “killer feature” of Emacs is org-mode and it’s constellation of packages.

* Org-Mode

Oh ~org-mode~, one of the “why you should use Emacs” packages.  It’s a set of organizational tools that allow for progressive adoption.  You can start writing in ~org-mode~ syntax and leave it at that.  From there you can delve further into the ~org-mode~ ecosystem.

A bit of pre-amble.  I maintain a list of data directories, each might have “relevant to org-mode” files.  The ~jf/org-agenda-files~ reads the file system to gather sources for ~org-mode~ agenda.

#+begin_src emacs-lisp
  (cl-defun jf/org-agenda-files (&key
				  (paths jf/data-directories)
				  (basenames '("agenda.org")))
    "Return the list of filenames where BASENAMES exists in PATHS."
    ;; I want to include my configuration file in my agenda querying.
    (setq returning-list '("~/git/dotemacs/emacs.d/configuration.org"))
    (dolist (path paths)
      (dolist (basename basenames)
	(when (f-exists-p (f-join path basename))
	    (add-to-list 'returning-list (f-join path basename)))))
    returning-list)
#+end_src

The rudimentary configuration of my ~org-mode~.  Later, I write about ~org-roam~ which introduces my more generalized note taking system.

#+begin_src emacs-lisp
  (use-package org
    :straight (org :type built-in)
    :hook (org-mode . turn-on-visual-line-mode)
    :config (setq
	     org-directory (file-truename "~/git/org")
	     org-agenda-files (jf/org-agenda-files
			       :paths jf/data-directories
			       :basenames '("agenda.org"))
	     org-default-notes-file (concat
				     org-directory
				     "/captured-notes.org")
	     org-todo-keywords '((sequence
				  "TODO"
				  "WAITING"
				  "|"
				  "DONE")))
    (setq org-capture-templates
	  '(("@"
	     "All Todo"
	     entry (file "~/git/org/agenda.org")
	     "* TODO %?\n  %i\n  %a"
	     :empty-lines-before 1)))


    (setq org-latex-default-class "jf/article")

    (org-babel-do-load-languages 'org-babel-load-languages
				 (append org-babel-load-languages
					 '((emacs-lisp . t)
					   (shell . t)
					   (plantuml . t)
					   (ruby . t))))
    :init (require 'ox)
    ;; I grabbed from the following LaTeX class from
    ;; https://www.reddit.com/r/emacs/comments/3zcr43/nooborgmode_custom_latexpdf_export_custom_style/.
    ;; I’m trash with LaTeX, but like the layout thusfar.
    (add-to-list 'org-latex-classes
		 '("jf/article"
		   "\\documentclass[11pt,a4paper]{article}
  \\usepackage[utf8]{inputenc}
  \\usepackage[T1]{fontenc}
  \\usepackage{fixltx2e}
  \\usepackage{graphicx}
  \\usepackage{longtable}
  \\usepackage{float}
  \\usepackage{wrapfig}
  \\usepackage{rotating}
  \\usepackage[normalem]{ulem}
  \\usepackage{amsmath}
  \\usepackage{textcomp}
  \\usepackage{marvosym}
  \\usepackage{wasysym}
  \\usepackage{amssymb}
  \\usepackage{hyperref}
  \\usepackage{mathpazo}
  \\usepackage{xcolor}
  \\usepackage{enumerate}
  \\definecolor{bg}{rgb}{0.95,0.95,0.95}
  \\tolerance=1000
	[NO-DEFAULT-PACKAGES]
	[PACKAGES]
	[EXTRA]

  \\linespread{1.1}
  \\hypersetup{pdfborder=0 0 0}"
		   ("\\section{%s}" . "\\section*{%s}")
		   ("\\subsection{%s}" . "\\subsection*{%s}")
		   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
		   ("\\paragraph{%s}" . "\\paragraph*{%s}")))

    ;; \\hypersetup{colorlinks=false,pdfborderstyle={/S/U/W 1},pdfborder=0 0 1}"
    ;; Make TAB act as if it were issued from the buffer of the languages's major
    ;; mode.
    :custom (org-src-tab-acts-natively t)
    :bind (:map org-mode-map
		("C-c l i" . jf/org-insert-link-dwim)
		("s-2" . consult-org-heading))
    :bind (("C-c l s" . org-store-link)
	   ("C-c a" . org-agenda)
	   ("C-c c" . org-capture)
	   ("C-s-t" . org-toggle-link-display)))

  (defun my-org-confirm-babel-evaluate (lang body) nil)
  (setq org-confirm-babel-evaluate #'my-org-confirm-babel-evaluate)

  ;; To make Org mode take care of versioning of attachments for you,
  ;; add the following to your Emacs config:
  (require 'org-attach-git)

  ;; See
  ;; https://www.reddit.com/r/orgmode/comments/i6hl8b/image_preview_size_in_org_mode/
  ;; for further discussion
  ;;
  ;; One consideration is that the below setq should be called as part
  ;; of the `org-toggle-inline-images`.  <2020-11-14 Sat 12:09>: I
  ;; commented out the lines below as it created a very small image
  ;; (about the size of one character).  (setq org-image-actual-width
  ;; (truncate (* (window-pixel-width) 0.8)))


  ;; I'd prefer to use the executable, but that doe not appear to be the
  ;; implementation of org-babel.
  (setq org-plantuml-jar-path (concat (string-trim (shell-command-to-string "brew-path plantuml")) "/libexec/plantuml.jar"))
#+end_src

#+RESULTS:
: /opt/homebrew/Cellar/plantuml/1.2022.3/libexec/plantuml.jar

I cribbed the following function from [[https://xenodium.com/emacs-dwim-do-what-i-mean/][Emacs DWIM: do what ✨I✨ mean]].

#+begin_src emacs-lisp
  (defun jf/org-insert-link-dwim ()
	"Like `org-insert-link' but with personal dwim preferences."
	(interactive)
	(let* ((point-in-link (org-in-regexp org-link-any-re 1))
	       (clipboard-url (when (string-match-p "^http" (current-kill 0))
				(current-kill 0)))
	       (region-content (when (region-active-p)
				 (buffer-substring-no-properties (region-beginning)
								 (region-end)))))
	  (cond ((and region-content clipboard-url (not point-in-link))
		 (delete-region (region-beginning) (region-end))
		 (insert (org-make-link-string clipboard-url region-content)))
		((and clipboard-url (not point-in-link))
		 (insert (org-make-link-string
			  clipboard-url
			  (read-string "Title: "
				       (with-current-buffer (url-retrieve-synchronously clipboard-url)
					 (dom-text (car
						    (dom-by-tag (libxml-parse-html-region
								 (point-min)
								 (point-max))
								'title))))))))
		(t
		 (call-interactively 'org-insert-link)))))
#+end_src

